//
//  ViewController.swift
//  CustomFont
//
//  Created by ebrahim hassan on 7/24/17.
//  Copyright © 2017 ebrahim hassan. All rights reserved.
//

import UIKit

class ViewController: UIViewController {

    @IBOutlet weak var ImageView: UIImageView!
    @IBOutlet weak var label : UITextView!
    override func viewDidLoad() {
        super.viewDidLoad()
        // Do any additional setup after loading the view, typically from a nib.
      //  ImageView.layer.cornerRadius=(ImageView.frame.width)/2
      //  ImageView.clipsToBounds=true
        label.text="أدمنت أحزاني   فصرت أخاف أن لا أحزنا   وطعنت ألافا من المرات   حتى صار يوجعني بأن لا أطعنا   ولعنت في كل اللغات   وصار يقلقني بأن لا ألعنا   ولقد شنقت على جدار قصائدي   ووصيتي كانت   بأن لا أدفنا   وتشابهت كل البلاد   فلا أرى نفسي هناك   ولا أرى نفسي هنا   وتشابهت كل النساء   فجسم مريم في الظلام كما مني   ما كان شعري لعبة عبثية   أو نزهة قمرية   إني أقول الشعر سيدتي   لأعرف من أنا   2   يا سادتي   إني أسافر في قطار مدامعي   هل يركب الشعراء إلا في قطارات الضنى؟   إني أفكر باختراع الماء   إن الشعر يجعل كل حلم ممكنا   وأنا أفكر باختراع النهد   حتى تطلع الصحراء بعدي سوسنا   وأنا أفكر باختراع الناي   حتى يأكل الفقراء بعدي  الميجنا   إن صادروا وطن الطفولة من يدي   فلقد جعلت من القصيدة موطنا   3   يا سادتي   إن السماء رحيبة جدا   ولكن الصيارفة الذين تقاسموا ميراثنا   وتقاسموا أوطاننا   وتقاسموا أجسادنا   لم يتركوا شبرا لنا   يا سادتي   قاتلت عصرا لا مثيل لقبحه   وفتحت جرح قبيلتي المتعفنا   أنا لست مكترثا   بكل الباعة المتجولين   وكل كتاب البلاط   وكل من جعلوا الكتابة حرفة   مثل الزنى   4   يا سادتي   عفوا إذا أقلقتكم   أنا لست مضطرا لأعلن توبتي   هذا أنا   هذا أنا   هذا أنا   حزب المطر   أنا لا أسكن في أي مكان   إن عنواني هو اللامنتظر   مبحرا كالسمك الوحشي في هذا المدى   في دمي نار وفي عيني شرر   ذاهبا أبحث عن حرية الريح   التي يتقنها كل الغجر   راكضا خلف غمام أخضر   شاربا بالعين الاف الصور   ذاهبا حتى نهايات السفر   مبحرا نحو فضاء اخر   نافضا عني غباري   ناسيا اسمي   وأسماء النباتات   وتاريخ الشجر   هاربا من هذه الشمس التي تجلدني   بكرابيج الضجر   هاربا من مدن نامت قرونا   تحت أقدام القمر   تاركا خلفي عيونا من زجاج   وسماء من حجر   ومضافات تميم ومضر   لا تقولي عد إلى الشمس فإني   أنتمي الان إلى حزب المطر"
    }

    override func didReceiveMemoryWarning() {
        super.didReceiveMemoryWarning()
        // Dispose of any resources that can be recreated.
    }


}

